print("""
      
██████╗░░█████╗░░░░░░░░██████╗████████╗░█████╗░████████╗░░░░░░██████╗░░█████╗░████████╗
██╔══██╗██╔══██╗░░░░░░██╔════╝╚══██╔══╝██╔══██╗╚══██╔══╝░░░░░░██╔══██╗██╔══██╗╚══██╔══╝
██████╔╝██║░░╚═╝█████╗╚█████╗░░░░██║░░░███████║░░░██║░░░█████╗██████╦╝██║░░██║░░░██║░░░
██╔═══╝░██║░░██╗╚════╝░╚═══██╗░░░██║░░░██╔══██║░░░██║░░░╚════╝██╔══██╗██║░░██║░░░██║░░░
██║░░░░░╚█████╔╝░░░░░░██████╔╝░░░██║░░░██║░░██║░░░██║░░░░░░░░░██████╦╝╚█████╔╝░░░██║░░░
╚═╝░░░░░░╚════╝░░░░░░░╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░░░░░░░╚═════╝░░╚════╝░░░░╚═╝░░░  
""")
print("Ver: BETA 1.0")
print("⌈ Вы можете получить свой токен у телеграм бота @BotFather")
print("⁅ Подробная инструкция в посте на Lolz")

TOKENg = input("⌊ Введите ваш token: ")
print("⌈ Вы можете получить свой ID у телеграм бота @my_id_bot")
id = input("⌊ Введите ваш id: ")
print("⌈ Сейчас вам нужно указать местоположение файла .exe (приложения которые запускаются через cmd не работают)")
app = input("⌊ Введите местоположение файла .exe: ")

print("⌈ Данные для авторизации в боте без ID")
login = input("⁅ Введите логин: ")
password = input("⌊ Введите пароль: ")

app1 = "'" + app + "'"
converted_path = app1.replace("\\", "\\\\")
converted_path = converted_path.replace('"', '')
with open("pc_stat_bot_tg\datapcstatbot.py", "w") as file:
    file.write(f"TOKENtg = '{TOKENg}' \n")
    file.write(f"authorized_ids = [{id}]\n")
    file.write(f"Appdata = {converted_path}\n")


with open("pc_stat_bot_tg\login.txt", "w") as file:
    file.write(f"{login}:{password}")

